# рядок = "Привіт"
# перший_символ = рядок[0]  # Повертає "П"
# другий_символ = рядок[-1]  # Повертає "р"
# print(перший_символ, другий_символ)

# text = "Hello, World!"
# substring = text[7:12]  # Вибираємо "World"
# print(len(text))
# print(substring)
# start: Початковий індекс (включно).
# stop: Кінцевий індекс (не включаючи).
# step: Крок, з яким вибираються елементи (за замовчуванням 1).

# riydok = "Привіт"
# for i in riydok:
#     print(riydok)


# row = "Це приклад для заміни у рядку."
# new_row = row.replace("приклад", "do")
# print(new_row)



