# Створіть масив зі строками, які будуть складатися з чисел, які розділені комою. Наприклад:
#
# ["1,2,3,4", "1,2,3,4,50", "qwerty1,2,3"]
#
# Для кожного елементу списку виведіть суму всіх чисел (створіть нову функцію для цього).
#
# Якщо є символи, що не є числами (”qwerty1,2,3” у прикладі), вам потрібно зловити вийняток і вивести “Не можу це зробити!”
#
# Використовуйте блок try\except, щоб уникнути інших символів, окрім чисел у списку.
#
# Для цього прикладу правильний вивід буде - 10, 60, “Не можу це зробити”


mass= ["1,2,3,4", "1,2,3,4,50", "qwerty1,2,3"]
# 1. Функция для подсчета суммы чисел в строке
def get_sum_of_string(string_element):
    try:
        parts = string_element.split(",")
        return sum(int(num) for num in parts)

    except ValueError:
        return "Не можу це зробити!"

for item in mass:
    result = get_sum_of_string(item)
    print(result)